app/controllers/todo_list_controller.rb

  def index
    @todo_list = TodoList.all.order(id: :asc)
---
SELECT "todo_lists".* FROM "todo_lists" ORDER BY "todo_lists"."id" ASC

  def create
    @todo_list = TodoList.new(todolist_create_params)
    if @todo_list.save
---
INSERT INTO "todo_lists" ("title", "is_success", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "todo 3"], ["is_success", nil], ["created_at", "2024-03-11 08:55:01.883660"], ["updated_at", "2024-03-11 08:55:01.883660"]]

  def update
    if @todo_list.update(todolist_update_params)
---
UPDATE "todo_lists" SET "is_success" = $1, "updated_at" = $2 WHERE "todo_lists"."id" = $3  [["is_success", true], ["updated_at", "2024-03-12 07:44:01.208486"], ["id", 1]]

    def find_id
      @todo_list = TodoList.find(params[:id])
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]